{
  "backend/main.mo": "Empty Motoko canister actor with no methods defined.",
  "feature_evidence.json": "Lists implemented features, associated files, components, and test IDs for recent updates including the new final page and navigation changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining Valentine-themed light and dark mode tokens.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with five routes and wraps everything in the SiteLayout component.",
  "frontend/src/components/PhotoGallery.tsx": "Responsive grid gallery component with dialog-based lightbox for viewing photos.",
  "frontend/src/components/RouteTransitionOverlay.tsx": "Full-screen overlay animating particle effects during route transitions, respecting reduced-motion preferences.",
  "frontend/src/components/SequentialPager.tsx": "Bottom pager enabling previous/next navigation across the five defined routes.",
  "frontend/src/components/SiteLayout.tsx": "Main layout with header, navigation, footer, and route transition overlay around routed content.",
  "frontend/src/components/SiteNav.tsx": "Top navigation bar listing five pages with icons and active-state styling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "React hook that returns whether the user prefers reduced motion using a media query listener.",
  "frontend/src/index.css": "Global Tailwind-based styling defining color variables, typography, animations, and background for the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/Page1Landing.tsx": "Landing page showing animated hearts, a long Valentine’s message, and two uploaded photos.",
  "frontend/src/pages/Page2Memories.tsx": "Displays a heading and a photo gallery of four memory images.",
  "frontend/src/pages/Page3Flowers.tsx": "Shows a flower icon, a generated flower image, and an emotional message.",
  "frontend/src/pages/Page4Gallery.tsx": "Renders an additional gallery of remaining uploaded photos with a header.",
  "frontend/src/pages/Page5Final.tsx": "Final page displaying four comic-style images showing where the story began.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, container settings, and custom keyframes.",
  "project_state.json": "Tracks project metadata, requirements, features, and architectural notes for the Valentine’s website."
}